__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_34 (InputLayer)           (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 4 35040       input_34[0][0]                   
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 8, 8, 8, 16)  263440      conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_reshape (Resh (None, 2048, 4)      0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 2048, 4)      0           primarycap_conv3d_reshape[0][0]  
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 10, 16)       1310720     primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
mask_35 (Mask)                  (None, 160)          0           sub_caps[0][0]                   
__________________________________________________________________________________________________
capsnet (Length)                (None, 10)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28282744    mask_35[0][0]                    
==================================================================================================
Total params: 29,891,944
Trainable params: 29,891,944
Non-trainable params: 0
__________________________________________________________________________________________________
