__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 2 186880      input_1[0][0]                    
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 7, 7, 7, 256) 47776000    conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_reshape (Resh (None, 10976, 8)     0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 10976, 8)     0           primarycap_conv3d_reshape[0][0]  
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 10, 16)       14049280    primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
mask_2 (Mask)                   (None, 160)          0           sub_caps[0][0]                   
__________________________________________________________________________________________________
capsnet (Length)                (None, 10)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28282744    mask_2[0][0]                     
==================================================================================================
Total params: 90,294,904
Trainable params: 90,294,904
Non-trainable params: 0
__________________________________________________________________________________________________
