__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_40 (InputLayer)           (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 4 35040       input_40[0][0]                   
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 8, 8, 8, 32)  526880      conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_reshape (Resh (None, 2048, 8)      0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 2048, 8)      0           primarycap_conv3d_reshape[0][0]  
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 10, 8)        1310720     primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
mask_41 (Mask)                  (None, 80)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
capsnet (Length)                (None, 10)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28241784    mask_41[0][0]                    
==================================================================================================
Total params: 30,114,424
Trainable params: 30,114,424
Non-trainable params: 0
__________________________________________________________________________________________________
