__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 4 35040       input_1[0][0]                    
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 9, 9, 9, 25)  150025      conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 9, 9, 9, 25)  0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
secondarycap_conv3d (Conv3D)    (None, 5, 5, 5, 25)  78150       primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
secondarycap_conv3d_reshape (Re (None, 625, 5)       0           secondarycap_conv3d[0][0]        
__________________________________________________________________________________________________
secondarycap_conv3d_squash (Lam (None, 625, 5)       0           secondarycap_conv3d_reshape[0][0]
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 40, 16)       2000000     secondarycap_conv3d_squash[0][0] 
__________________________________________________________________________________________________
mask_2 (Mask)                   (None, 640)          0           sub_caps[0][0]                   
__________________________________________________________________________________________________
capsnet (Length)                (None, 40)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28528504    mask_2[0][0]                     
==================================================================================================
Total params: 30,791,719
Trainable params: 30,791,719
Non-trainable params: 0
__________________________________________________________________________________________________
