__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 2 186880      input_10[0][0]                   
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 7, 7, 7, 8)   1493000     conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_reshape (Resh (None, 343, 8)       0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 343, 8)       0           primarycap_conv3d_reshape[0][0]  
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 40, 8)        878080      primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
mask_11 (Mask)                  (None, 320)          0           sub_caps[0][0]                   
__________________________________________________________________________________________________
capsnet (Length)                (None, 40)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28364664    mask_11[0][0]                    
==================================================================================================
Total params: 30,922,624
Trainable params: 30,922,624
Non-trainable params: 0
__________________________________________________________________________________________________
