__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_16 (InputLayer)           (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 2 17520       input_16[0][0]                   
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 9, 9, 9, 16)  48016       conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_reshape (Resh (None, 2916, 4)      0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 2916, 4)      0           primarycap_conv3d_reshape[0][0]  
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 40, 16)       7464960     primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
mask_17 (Mask)                  (None, 640)          0           sub_caps[0][0]                   
__________________________________________________________________________________________________
capsnet (Length)                (None, 40)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28528504    mask_17[0][0]                    
==================================================================================================
Total params: 36,059,000
Trainable params: 36,059,000
Non-trainable params: 0
__________________________________________________________________________________________________
