__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 30, 30, 30, 1 0                                            
__________________________________________________________________________________________________
conv1 (Conv3D)                  (None, 22, 22, 22, 4 35040       input_1[0][0]                    
__________________________________________________________________________________________________
primarycap_conv3d (Conv3D)      (None, 7, 7, 7, 32)  1119776     conv1[0][0]                      
__________________________________________________________________________________________________
primarycap_conv3d_reshape (Resh (None, 1372, 8)      0           primarycap_conv3d[0][0]          
__________________________________________________________________________________________________
primarycap_conv3d_squash (Lambd (None, 1372, 8)      0           primarycap_conv3d_reshape[0][0]  
__________________________________________________________________________________________________
sub_caps (CapsuleLayer)         (None, 10, 16)       1756160     primarycap_conv3d_squash[0][0]   
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
mask_1 (Mask)                   (None, 160)          0           sub_caps[0][0]                   
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
capsnet (Length)                (None, 10)           0           sub_caps[0][0]                   
__________________________________________________________________________________________________
decoder (Sequential)            (None, 30, 30, 30, 1 28282744    mask_1[0][0]                     
==================================================================================================
Total params: 31,193,720
Trainable params: 31,193,720
Non-trainable params: 0
__________________________________________________________________________________________________
